app/views/comments/create.js.erb

$( '<%= j(render @comment) %>' ).hide().insertBefore($('#comment_form_header').last()).show( "slow" );
$('#comments > h2').html('This article has <%= escape_javascript(pluralize(@post.comments.count, 'comment')) %>');
---
INSERT INTO "comments" ("comment", "post_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["comment", "dggd"], ["post_id", 185], ["user_id", 2], ["created_at", "2015-12-07 05:09:31.700807"], ["updated_at", "2015-12-07 05:09:31.700807"]]
SELECT COUNT(*) FROM "comments" WHERE "comments"."post_id" = ?  [["post_id", 3]]