app/views/posts/_post.html.haml

INSERT INTO "posts" ("title", "content", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "fg"], ["content", "fgdfggdggggggggg"], ["user_id", 2], ["created_at", "2015-12-05 02:22:28.650349"], ["updated_at", "2015-12-05 02:22:28.650349"]]
---
    Published at
    =time_ago_in_words(post.created_at)