app/controllers/comments_controller.rb

   def edit
      @post = Post.find(params[:post_id])
      @comment = @post.comments.find(params[:id])
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1
SELECT  "comments".* FROM "comments" WHERE "comments"."post_id" = ? AND "comments"."id" = ? LIMIT 1

   def create
      if user_signed_in?
         @post = Post.find(params[:post_id])
         @comment = @post.comments.new(comment_params)
         @comment.user_id = current_user.id if current_user
         respond_to do |format|
            if @comment.save
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 3]]
INSERT INTO "comments" ("comment", "post_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["comment", "refgrgrgehrte"], ["post_id", 3], ["user_id", 1], ["created_at", "2015-11-03 15:36:20.362398"], ["updated_at", "2015-11-03 15:36:20.362398"]]

   def update
      @post = Post.find(params[:post_id])
      @comment = @post.comments.find(params[:id])

      respond_to do |format|
         if @comment.update(comment_params)
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 3]]
SELECT  "comments".* FROM "comments" WHERE "comments"."post_id" = ? AND "comments"."id" = ? LIMIT 1  [["post_id", 3], ["id", 7]]
UPDATE "comments" SET "comment" = ?, "updated_at" = ? WHERE "comments"."id" = ?  [["comment", "ciao2"], ["updated_at", "2015-11-03 16:06:46.076814"], ["id", 7]]

   def destroy
      @post = Post.find(params[:post_id])
      @comment = @post.comments.find(params[:id])

      @comment.destroy
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 3]]
SELECT  "comments".* FROM "comments" WHERE "comments"."id" = ? LIMIT 1
DELETE FROM "comments" WHERE "comments"."id" = ?  [["id", 5]]