app/controllers/posts_controller.rb

  def create
    @post = current_user.posts.build(post_params)

    respond_to do |format|
      if @post.save
---
INSERT INTO "posts" ("title", "content", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "vasco"], ["content", "questo è un cantante"], ["user_id", 1], ["created_at", "2015-11-02 01:30:09.975537"], ["updated_at", "2015-11-02 01:30:09.975537"]]

  def update
    respond_to do |format|
      if @post.update(post_params)
---
UPDATE "posts" SET "title" = ?, "content" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["title", "sfdfsdfsdfdfdssdf"], ["content", "cuhdfe23sfdfsd"], ["updated_at", "2015-12-05 20:13:11.134047"], ["id", 63]]